Revit 2027 API
Viewport.GetPositionAtViewAnchor Method
 Gets the position coordinates at the ViewAnchor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetPositionAtViewAnchor(
	ViewAnchor viewAnchor
)
Public Function GetPositionAtViewAnchor (
	viewAnchor As ViewAnchor
) As XYZ
public:
XYZ^ GetPositionAtViewAnchor(
	ViewAnchor viewAnchor
)
member GetPositionAtViewAnchor :
        viewAnchor : ViewAnchor -> XYZ
Parameters
viewAnchor ViewAnchor
 The viewAnchor at which the position is requested.
Return Value
XYZ
 The position at the ViewAnchor.
Exceptions
Exception | Condition
ArgumentException |  The given value of viewAnchor cannot be applied to this Viewport.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace